ARMmbed/mbed-os/targets/TARGET_Geehy/TARGET_APM32F4XX/TARGET_APM32F407IG/PeripheralPins.c
/* mbed Microcontroller Library
 * Copyright (c) 2006-2023 ARM Limited
 * Copyright (c) 2023 Geehy Semiconductor Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#include "PeripheralPins.h"
#include "apm32f4xx_gpio.h"

#define   GPIO_AF_0   0
#define   GPIO_AF_1   1
#define   GPIO_AF_2   2
#define   GPIO_AF_3   3
#define   GPIO_AF_4   4
#define   GPIO_AF_5   5
#define   GPIO_AF_6   6
#define   GPIO_AF_7   7
#define   GPIO_AF_8   8
#define   GPIO_AF_9   9
#define   GPIO_AF_10  10
#define   GPIO_AF_11  11
#define   GPIO_AF_12  12
#define   GPIO_AF_13  13
#define   GPIO_AF_14  14
#define   GPIO_AF_15  15

/* void pin_function(PinName pin, int function);
   configure the mode, output mode, pull, speed, af function of pins
   the parameter function contains the configuration information,show as below
   bit 0:2     gpio mode input / output / af / analog
   bit 3       output push-pull / open drain
   bit 5:4     no pull, pull-up, pull-down
   bit 9:6     channel af function
   bit 11:10   gpio speed
   bit 16:12   channel of adc/timer/dac
   bit 17      PWM channel-ON
   bit 31:18   reserved
*/

/* GPIO MODE */
const int APM_GPIO_MODE[] = {
    GPIO_MODE_IN,        /* 0 */
    GPIO_MODE_OUT,       /* 1 */
    GPIO_MODE_AF,        /* 2 */
    GPIO_MODE_AN,        /* 3 */
};

/* GPIO pull_up_down */
const int APM_GPIO_PULL_UP_DOWN[] = {
    GPIO_PUPD_NOPULL,     /* 0 */
    GPIO_PUPD_UP,         /* 1 */
    GPIO_PUPD_DOWN,       /* 2 */
};

/* GPIO otype */
const int APM_GPIO_OUTPUT_MODE[] = {
    GPIO_OTYPE_PP,        /* 0 */
    GPIO_OTYPE_OD,        /* 1 */
};

/* GPIO SPEED */
const int APM_GPIO_SPEED[] = {
    GPIO_SPEED_2MHz,            /* 0 */
    GPIO_SPEED_25MHz,           /* 1 */
    GPIO_SPEED_50MHz,           /* 2 */
    GPIO_SPEED_100MHz,          /* 3 */
};

/* GPIO AF */
const int APM_GPIO_AF[] = {
    GPIO_AF_0,              /* 0 */
    GPIO_AF_1,              /* 1 */
    GPIO_AF_2,              /* 2 */
    GPIO_AF_3,              /* 3 */
    GPIO_AF_4,              /* 4 */
    GPIO_AF_5,              /* 5 */
    GPIO_AF_6,              /* 6 */
    GPIO_AF_7,              /* 7 */
    GPIO_AF_8,              /* 8 */
    GPIO_AF_9,              /* 9 */
    GPIO_AF_10,             /* 10 */
    GPIO_AF_11,             /* 11 */
    GPIO_AF_12,             /* 12 */
    GPIO_AF_13,             /* 13 */
    GPIO_AF_14,             /* 14 */
    GPIO_AF_15,             /* 15 */
};

/* ADC PinMap */
const PinMap PinMap_ADC[] = {
    {PA_0, ADC_1, SET_PIN_FUNCTION_ADC_CHANNEL(0)},    /* ADC0_IN0 */
    {PA_1, ADC_1, SET_PIN_FUNCTION_ADC_CHANNEL(1)},    /* ADC0_IN1 */
    {PA_2, ADC_1, SET_PIN_FUNCTION_ADC_CHANNEL(2)},    /* ADC0_IN2 */
    {PA_3, ADC_1, SET_PIN_FUNCTION_ADC_CHANNEL(3)},    /* ADC0_IN3 */
    {PA_4, ADC_1, SET_PIN_FUNCTION_ADC_CHANNEL(4)},    /* ADC0_IN4 */
    {PA_5, ADC_1, SET_PIN_FUNCTION_ADC_CHANNEL(5)},    /* ADC0_IN5 */
    {PA_6, ADC_1, SET_PIN_FUNCTION_ADC_CHANNEL(6)},    /* ADC0_IN6 */
    {PA_7, ADC_1, SET_PIN_FUNCTION_ADC_CHANNEL(7)},    /* ADC0_IN7 */
    {PB_0, ADC_1, SET_PIN_FUNCTION_ADC_CHANNEL(8)},    /* ADC0_IN8 */
    {PB_1, ADC_1, SET_PIN_FUNCTION_ADC_CHANNEL(9)},    /* ADC0_IN9 */
    {PC_0, ADC_1, SET_PIN_FUNCTION_ADC_CHANNEL(10)},   /* ADC0_IN10 */
    {PC_1, ADC_1, SET_PIN_FUNCTION_ADC_CHANNEL(11)},   /* ADC0_IN11 */
    {PC_2, ADC_1, SET_PIN_FUNCTION_ADC_CHANNEL(12)},   /* ADC0_IN12 */
    {PC_3, ADC_1, SET_PIN_FUNCTION_ADC_CHANNEL(13)},   /* ADC0_IN13 */
    {PC_4, ADC_1, SET_PIN_FUNCTION_ADC_CHANNEL(14)},   /* ADC0_IN14 */
    {PC_5, ADC_1, SET_PIN_FUNCTION_ADC_CHANNEL(15)},   /* ADC0_IN15 */
    {ADC_TEMP, ADC_1, SET_PIN_FUNCTION_ADC_CHANNEL(16)},  /* ADC0_IN16 */
    {ADC_VREF, ADC_1, SET_PIN_FUNCTION_ADC_CHANNEL(17)},  /* ADC0_IN17 */
    {ADC_VBAT, ADC_1, SET_PIN_FUNCTION_ADC_CHANNEL(18)},  /* ADC0_IN18 */

    {PA_0_MUL0, ADC_2, SET_PIN_FUNCTION_ADC_CHANNEL(0)},   /* ADC1_IN0 */
    {PA_1_MUL0, ADC_2, SET_PIN_FUNCTION_ADC_CHANNEL(1)},   /* ADC1_IN1 */
    {PA_2_MUL0, ADC_2, SET_PIN_FUNCTION_ADC_CHANNEL(2)},   /* ADC1_IN2 */
    {PA_3_MUL0, ADC_2, SET_PIN_FUNCTION_ADC_CHANNEL(3)},   /* ADC1_IN3 */
    {PA_4_MUL0, ADC_2, SET_PIN_FUNCTION_ADC_CHANNEL(4)},   /* ADC1_IN4 */
    {PA_5_MUL0, ADC_2, SET_PIN_FUNCTION_ADC_CHANNEL(5)},   /* ADC1_IN5 */
    {PA_6_MUL0, ADC_2, SET_PIN_FUNCTION_ADC_CHANNEL(6)},   /* ADC1_IN6 */
    {PA_7_MUL0, ADC_2, SET_PIN_FUNCTION_ADC_CHANNEL(7)},   /* ADC1_IN7 */
    {PB_0_MUL0, ADC_2, SET_PIN_FUNCTION_ADC_CHANNEL(8)},   /* ADC1_IN8 */
    {PB_1_MUL0, ADC_2, SET_PIN_FUNCTION_ADC_CHANNEL(9)},   /* ADC1_IN9 */
    {PC_0_MUL0, ADC_2, SET_PIN_FUNCTION_ADC_CHANNEL(10)},  /* ADC1_IN10 */
    {PC_1_MUL0, ADC_2, SET_PIN_FUNCTION_ADC_CHANNEL(11)},  /* ADC1_IN11 */
    {PC_2_MUL0, ADC_2, SET_PIN_FUNCTION_ADC_CHANNEL(12)},  /* ADC1_IN12 */
    {PC_3_MUL0, ADC_2, SET_PIN_FUNCTION_ADC_CHANNEL(13)},  /* ADC1_IN13 */
    {PC_4_MUL0, ADC_2, SET_PIN_FUNCTION_ADC_CHANNEL(14)},  /* ADC1_IN14 */
    {PC_5_MUL0, ADC_2, SET_PIN_FUNCTION_ADC_CHANNEL(15)},  /* ADC1_IN15 */

    {PA_0_MUL1, ADC_3, SET_PIN_FUNCTION_ADC_CHANNEL(0)},   /* ADC2_IN0 */
    {PA_1_MUL1, ADC_3, SET_PIN_FUNCTION_ADC_CHANNEL(1)},   /* ADC2_IN1 */
    {PA_2_MUL1, ADC_3, SET_PIN_FUNCTION_ADC_CHANNEL(2)},   /* ADC2_IN2 */
    {PA_3_MUL1, ADC_3, SET_PIN_FUNCTION_ADC_CHANNEL(3)},   /* ADC2_IN3 */
    {PF_6,      ADC_3, SET_PIN_FUNCTION_ADC_CHANNEL(4)},   /* ADC2_IN4 */
    {PF_7,      ADC_3, SET_PIN_FUNCTION_ADC_CHANNEL(5)},   /* ADC2_IN5 */
    {PF_8,      ADC_3, SET_PIN_FUNCTION_ADC_CHANNEL(6)},   /* ADC2_IN6 */
    {PF_9,      ADC_3, SET_PIN_FUNCTION_ADC_CHANNEL(7)},   /* ADC2_IN7 */
    {PF_10,     ADC_3, SET_PIN_FUNCTION_ADC_CHANNEL(8)},   /* ADC2_IN8 */
    {PF_3,      ADC_3, SET_PIN_FUNCTION_ADC_CHANNEL(9)},   /* ADC2_IN9 */
    {PC_0_MUL1, ADC_3, SET_PIN_FUNCTION_ADC_CHANNEL(10)},  /* ADC2_IN10 */
    {PC_1_MUL1, ADC_3, SET_PIN_FUNCTION_ADC_CHANNEL(11)},  /* ADC2_IN11 */
    {PC_2_MUL1, ADC_3, SET_PIN_FUNCTION_ADC_CHANNEL(12)},  /* ADC2_IN12 */
    {PC_3_MUL1, ADC_3, SET_PIN_FUNCTION_ADC_CHANNEL(13)},  /* ADC2_IN13 */
    {PF_4,      ADC_3, SET_PIN_FUNCTION_ADC_CHANNEL(14)},  /* ADC2_IN14 */
    {PF_5,      ADC_3, SET_PIN_FUNCTION_ADC_CHANNEL(15)},  /* ADC2_IN15 */
    {NC,   NC,    0}
};

/* DAC PinMap */
const PinMap PinMap_DAC[] = {
    {PA_4,       DAC_1, SET_PIN_FUNCTION_DAC_CHANNEL(0)},    /* DAC_OUT1 */
    {PA_5,       DAC_1, SET_PIN_FUNCTION_DAC_CHANNEL(1)},    /* DAC_OUT2 */
    {NC, NC, 0}
};


